[
  {
    "name": "Air & Space Forces Association",
    "website": "https://www.afa.org/",
    "phone": "(703) 247-5800",
    "summary": "The Air & Space Forces Association (AFA) is an independent, 501(c)(3) non-profit, professional military association for the United States Air Force and United States Space Force. Headquartered in Arlington, Virginia, its declared mission is \"to educate the public about air and space power, to advocate for the world's most capable, most lethal, and most effective Air and Space Forces, and to support Airmen, Guardians, and their families.\"[5][2]"
  },
  {
    "name": "Airlift/Tanker Association",
    "website": "http://www.atalink.org",
    "phone": "(423) 902-2297",
    "summary": "The Airlift/Tanker Association (A/TA), formerly the Airlift Association, is an American non-profit organization that supports the United States Air Force's airlift and air mobility operations. The A/TA is a partner of the Air Mobility Command."
  },
  {
    "name": "American War Memorials Overseas",
    "website": "http://www.uswarmemorials.org/",
    "phone": "888-224-6108",
    "summary": "American War Memorials Overseas (AWMO) was founded in 2008 and is a non-profit corporation working to document, promote, and preserve non-government supported War Memorials honoring Americans outside of the United States. American War Memorials Overseas is a 501(c)(3) nonprofit corporation and as such is entirely dependent on donated funds.[1]"
  },
  {
    "name": "AMVETS",
    "website": "http://amvets.org",
    "phone": "(301) 459-9600",
    "summary": "American Veterans (AMVETS) is a non-partisan, volunteer-led organization formed by World War II veterans of the United States military. It advocates for its members as well as for causes that its members deem helpful to the nation at large. The group holds a Federal charter under Title 36 of the United States Code. It is a 501(c)19 organization."
  },
  {
    "name": "Army and Navy Union of the United States of America",
    "website": "http://armyandnavyunion.org",
    "phone": "609-774-1660",
    "summary": "The Army and Navy Union (A&NU), formally the Army and Navy Union of the United States of America is the oldest veterans' organization in the United States. It was organized on March 31, 1888, in Ohio. Its name changed over time from just a soldier's union to take account for all sailors and soldiers in all branches of the United States Armed Forces."
  },
  {
    "name": "Blinded Veterans Association",
    "website": "http://bva.org",
    "phone": "(844) 250-5180",
    "summary": "The Blinded Veterans Association (BVA) is a U.S non-profit organization that was established to \"help veterans and their families meet and overcome the challenges of blindness\"."
  },
  {
    "name": "D'Aniello Institute for Veterans and Military Families",
    "website": "http://ivmf.syracuse.edu",
    "phone": "315-443-0141",
    "summary": "The D'Aniello Institute for Veterans and Military Families (IVMF) is an interdisciplinary research institution that informs and advances the policy, economic and wellness concerns of the America’s veterans and families.[3] It is housed in the National Veterans Resource Center at Syracuse University. The IVMF annually serves thousands of U.S. veterans, service members, and their families around the world and as of 2024, the Institute had served 200,000 military service members, veterans, and their families through their programs.[4]"
  },
  {
    "name": "Forty and Eight",
    "website": "http://fortyandeight.org",
    "phone": "(317) 634-1804",
    "summary": "La Société des 40 Hommes et 8 Chevaux (English: \"The Society of 40 Men and 8 Horses\"), commonly known as the Forty and Eight, is a patriotic organization of U.S. veterans headquartered in Indianapolis, Indiana. It is made up of state, U.S. territory, and overseas grande, and these are in turn made up of locale. It was founded in March 1920 at Philadelphia, Pennsylvania, as an honor society of The American Legion, by World War I veteran, and Legionnaire, Joseph William Breen."
  },
  {
    "name": "Gary Sinise Foundation",
    "website": "https://www.garysinisefoundation.org/",
    "phone": "(615) 575-3500",
    "summary": "The Gary Sinise Foundation is a charity and veterans service organization that offers a variety of programs, services and events for wounded veterans of the military. It operates as a nonprofit 501(c)(3) organization.[1] Among its programs is the construction of specially adapted smart homes for severely wounded veterans that are provided mortgage-free.[2] From 2011 to 2021 the Gary Sinise Foundation has raised over $300 million for wounded veterans, first responders, and their families.[3]"
  },
  {
    "name": "Iraq and Afghanistan Veterans of America",
    "website": "http://iava.org/",
    "phone": "(202) 544-7692",
    "summary": "Iraq and Afghanistan Veterans of America (IAVA), is a nonprofit 501(c)(3) veterans organization founded by Paul Rieckhoff, an American writer, social entrepreneur, advocate, activist and veteran of the United States Army and the Iraq War. He served as an Army First Lieutenant and infantry rifle platoon leader in Iraq from 2003 through 2004. Rieckhoff was released from the Army National Guard in 2007."
  },
  {
    "name": "Jewish War Veterans of the United States of America",
    "website": "http://www.jwv.org/",
    "phone": "202-265-6280",
    "summary": "Jewish War Veterans of the United States of America (also referred to as Jewish War Veterans of the U.S.A., Jewish War Veterans, or JWV) is an American Jewish veterans' organization created in 1896 by American Civil War veterans to raise awareness of contributions made by Jewish service members.[1][2]"
  },
  {
    "name": "K9s for Warriors",
    "website": "http://www.k9sforwarriors.org/",
    "phone": "904-686-1956",
    "summary": "K9s For Warriors is an American charity and veterans service organization that provides service dogs to veterans.[3] The organization trains rescue dogs to help veterans coping with post-traumatic stress disorder (PTSD), traumatic brain injury, military sexual trauma, post-9/11 issues and other psychological challenges associated with military service."
  },
  {
    "name": "Legion of Valor of the United States of America",
    "website": "http://legionofvalor.com",
    "phone": "(202) 320-3295",
    "summary": "The Legion of Valor of the United States of America, commonly known as the Legion of Valor, is a war veterans' organization created to promote patriotic allegiance, fidelity to the United States Constitution, and popular support for civil liberties and the permanence of free institutions.[1] Membership is open to recipients of the Medal of Honor, the Distinguished Service Cross, the Navy Cross, and the Air Force Cross.[2]"
  },
  {
    "name": "Marine Corps League",
    "website": "http://mclnational.org",
    "phone": "(703) 207-9588",
    "summary": "The Marine Corps League is the only congressionally chartered United States Marine Corps-related veterans organization in the United States.  Its congressional charter was approved by the 75th U.S. Congress and signed by President Franklin D. Roosevelt on August 4, 1937.  The organization credits Major General John A. Lejeune, the 13th Marine Corps commandant, as one of its founding members."
  },
  {
    "name": "Military Officers Association of America",
    "website": "http://moaa.org",
    "phone": "800-234-6622",
    "summary": "The Military Officers Association of America (MOAA) is a professional association of United States military officers. It is a nonprofit organization that advocates for a strong national defense, but is politically nonpartisan.[citation needed]  The association supports government policies that benefit military members and their families. Its membership is made up of active duty, retired, and former commissioned officers and warrant officers from the uniformed services of the United States."
  },
  {
    "name": "Military Order of the Cootie",
    "website": "http://lotcs.org",
    "phone": "412-824-2240",
    "summary": "The Military Order of the Cootie of the United States (MOC, or simply Military Order of the Cootie) is a national honor degree membership association separately constituted as a subordinate and as an auxiliary order chartered by the Veterans of Foreign Wars of the United States (VFW).[1] The organization's services include supporting the VFW National Home and veterans hospitals.[2] Founded in 1920, it became a subsidiary of the VFW in 1923.[3][4][5]"
  },
  {
    "name": "National Association of State Approving Agencies",
    "website": "http://www.nasaa-vetseducation.com",
    "phone": "804-225-2298",
    "summary": "National Association of State Approving Agencies (NASAA) is a member association that facilitates the efforts of its member State Approving Agencies (SAAs) in the United States of America, to promote and safeguard quality education and training programs for veterans, ensuring greater education and training opportunities for veterans, and protecting the integrity of the GI Bill.[1]"
  },
  {
    "name": "Operation Free",
    "website": "http://www.operationfree.net/",
    "phone": "(844)660-0084",
    "summary": "Operation Free is a coalition of veterans and national security organizations founded in August 2009 by the Truman National Security Project, The National Security Initiative, VoteVets.org, and VetPAC.  Operation Free, in collaboration with other organizations, works to raise awareness, among policymakers and the public, of the national security threat posed by climate change and the United States' reliance on oil.[1][2]"
  },
  {
    "name": "Paralyzed Veterans of America",
    "website": "http://pva.org",
    "phone": "866-734-0857",
    "summary": "The Paralyzed Veterans of America was established in 1946 with the goal of serving the needs of disabled veterans. The organization was created to assist members, such as veterans of the armed forces living with spinal cord injuries or diseases like multiple sclerosis (MS) or amyotrophic lateral sclerosis (ALS) in living with increased independence and dignity."
  },
  {
    "name": "Purple Heart Foundation",
    "website": "https://purpleheartfoundation.org/",
    "phone": "703-256-6139",
    "summary": "The Purple Heart Foundation is a 501(c)(3) non-profit organization headquartered in Annandale, Virginia.[1] Its declared purpose is \"to enhance the quality of life of Purple Heart recipients and other honorably discharged veterans and their families.\"[2][3]"
  },
  {
    "name": "Semper Fi & America's Fund",
    "website": "https://thefund.org/",
    "phone": "760-725-3680",
    "summary": "Semper Fi & America's Fund is a non-profit 501(c)(3) organization that provides a variety of programs to assist wounded veterans in all branches of the United States Armed Forces. The organization describes its mission as \"providing urgently needed resources and financial support for combat wounded, critically ill and catastrophically injured members\" of the U.S. Armed Forces and their families.[1] As of November 2023, Semper Fi & America's Fund (The Fund) has provided more than $312 million in assistance to over 31,000 service members and their families.[2]"
  },
  {
    "name": "The Silver Star Families of America",
    "website": "http://www.silverstarfamilies.org/SSFOA-History.html",
    "phone": "417-743-2508",
    "summary": "The Silver Star Families of America (SSFOA) is a 501(c) tax exempt organization dedicated to honoring and supporting wounded, ill and injured veterans of all branches of the armed forces of the United States of America.[1] The organization was founded in 2004 by Steve and Diana Newton with the assistance of Joseph and Sharon Newton and the entire Newton family.[2]  It is not related to the military decoration designated the Silver Star."
  },
  {
    "name": "SoldierStrong",
    "website": "http://www.soldierstrong.org/",
    "phone": "888-898-3235",
    "summary": "SoldierStrong (formerly SoldierSocks) is a Stamford, Connecticut based 501(c)(3) charitable organization whose mission is to help America's military veterans take their next steps forward in life after service.[1]"
  },
  {
    "name": "Space Force Association",
    "website": "http://ussfa.org",
    "phone": "855-732-2019",
    "summary": "The Space Force Association (SFA) is an independent, 501(c)(3) non-profit organization that serves as a professional military association, space advocacy group, and space education association for the United States Space Force and space professionals at large."
  },
  {
    "name": "Student Veterans of America",
    "website": "http://studentveterans.org",
    "phone": "(202) 223-4710",
    "summary": "Student Veterans of America (SVA), is a 501(c)(3) non-profit organization focused on addressing the needs and concerns of American military veterans in higher education. SVA is best known for being an umbrella organization for student veterans' groups that advocates for improvements in veterans educational benefits. Its efforts, combined with other veterans' service organizations, led to passage of the Post-9/11 Veterans Educational Assistance Act of 2008. Senator Jim Webb (D-VA), a lead sponsor of the legislation, has cited SVA's efforts as one of the primary reasons the new G.I. Bill was signed into law on June 30, 2008.[1]"
  },
  {
    "name": "Swords to Plowshares",
    "website": "https://www.va.gov/ogc/accreditation.asp",
    "phone": "(202) 495-5909",
    "summary": "Swords to Plowshares is a veterans service organization that provides job training, housing, and benefits advocacy to low income and homeless U.S. military veterans.  Since 1974, Swords to Plowshares has advocated on behalf of all veterans, providing services that are informed by the experiences of their clients. The agency operates two service centers for veterans to access resources and begin their path to housing, self-sufficiency, and/or healthcare. Swords to Plowshares also advocates for the rights and wellbeing of veterans at the federal, state, and local levels.[1]  It is a 501(c)(3) non-profit organization headquartered in San Francisco, supported by governmental and private grants, as well as donations from individuals.[2] Tramecia Garner is the executive director."
  },
  {
    "name": "Ukrainian American Veterans",
    "website": "http://www.uavets.org/",
    "phone": "847-825-1717",
    "summary": "The Ukrainian American Veterans (UAV, Ukrainian: Українські Американські Ветерани, romanized: Ukrains'ki Amerykans'ki Veterany)  is a 501(c)(19) non-profit organization of the United States, composed of Honorably Discharged Veterans of the United States Armed Forces, who are of Ukrainian heritage or descent. The UAV obtained its tax-exempt status from the IRS in 1984 and was incorporated in the State of New York in 1987.[1] The organization is governed by a volunteer National Executive Board (NEB), headed by a National Commander, elected at a National Convention."
  },
  {
    "name": "Uniformed Services Benefit Association",
    "website": "https://www.usba.com/",
    "phone": "800-821-7912",
    "summary": "The Uniformed Services Benefit Association (USBA) is a nonprofit organization headquartered in Overland Park, Kansas,[1] providing affordable group life insurance plans and other financial services specifically designed for active duty and retired military members and their families, as well as honorably discharged veterans, National Guard and Reserve members, and federal civilian employees.[2]"
  },
  {
    "name": "United Spanish War Veterans",
    "website": "https://ssawv.org/history/",
    "phone": "518-365-5244",
    "summary": "The United Spanish War Veterans was an American veterans' organization which consisted of veterans of the Spanish–American War, Philippine–American War and China Relief Expedition."
  },
  {
    "name": "United Spinal Association",
    "website": "https://rarediseases.org/organizations/united-spinal-association/",
    "phone": "617-249-7300",
    "summary": "United Spinal Association is a nonprofit membership, disability rights and veterans service organization in the United States. It was formed in 1946 as Eastern Paralyzed Veterans Association by a group of paralyzed World War II veterans from New York City.[1]"
  },
  {
    "name": "Veterans Inc.",
    "website": "http://www.veteransinc.org",
    "phone": "(800) 482-2565",
    "summary": "Shrewsbury, Massachusetts"
  },
  {
    "name": "Vets For Freedom",
    "website": "https://www.usfca.edu/arts-sciences/programs/graduate/public-leadership",
    "phone": "(415) 422-7371",
    "summary": "Vets for Freedom is an American political advocacy organization founded in 2006 by veterans of the Iraq and Afghan wars, with connections to Republican Party leaders.[1] The group was initially founded as a 527 group.[1][2]"
  },
  {
    "name": "Vietnam Veterans of America",
    "website": "http://vva.org/",
    "phone": "301-585-4000",
    "summary": "Vietnam Veterans of America, Inc. (VVA) is a national non-profit corporation founded in 1978 in the United States that is committed to serving the needs of all veterans. It is funded without any contribution from any branch of government. VVA is the only such organization chartered by the United States Congress and dedicated to Vietnam War veterans and their families. The group holds a congressional charter under Title 36 of the United States Code."
  },
  {
    "name": "Vietnamese American Armed Forces Association",
    "website": "http://www.vaafa.org",
    "phone": "714-386-9896",
    "summary": "The Vietnamese American Armed Forces Association (abbreviated: VAAFA), (Vietnamese: Hội Quân Nhân Người Mỹ Gốc Việt), is a non-profit, non partisan professional military association. It is the first military association for Vietnamese American service members in the United States.  Its members are Active, Reserve, National Guard, and Veterans of the U.S Armed Forces; Enlisted and Commissioned Officers from the five branches of the U.S. Military; U.S. Army, U.S. Marine Corps, U.S. Navy, U.S. Air Force, and U.S. Coast Guard and the two noncombatant uniformed services the National Oceanic and Atmospheric Administration Commissioned Corps (NOAAC) and the United States Public Health Service Commissioned Corps (PHSCC)."
  },
  {
    "name": "VoteVets.org",
    "website": "http://www.votevets.org",
    "phone": "(555) 555-5555",
    "summary": "VoteVets.org is a progressive political action committee (PAC) and 501(c)(4) nonprofit organization in the United States.[1][3][4][5][6][7]"
  },
  {
    "name": "Yellow Ribbon Fund",
    "website": "https://yellowribbonfund.org/",
    "phone": "240-223-1180",
    "summary": "The Yellow Ribbon Fund (YRF) is a charity that primarily helps returning American service men & women, injured during active service, who are recovering at Walter Reed Army Medical Center and Bethesda Naval Hospital. The charity was founded on March 1, 2005[1] and is based in Bethesda, MD."
  },
  {
    "name": "Veterans Forge",
    "website": "https://veteransforge.org",
    "phone": "1 833 858 4338",
    "summary": "A nonprofit founded by veterans that provides specialized training in AI, emerging technologies, and career support to help US military veterans transition into tech careers."
  }
]